<?php

namespace Database\Seeders;

use App\Models\TemplateString;
use Illuminate\Database\Seeder;

class RuLangSeeder extends Seeder
{

    const DATA = [
        'common'         => [
            'title'       => 'VESPER – коллекция резиденций от BAZIS-A в Алматы',
            'description' => 'Впечатляющая коллекция резиденций на пересечении Аль-Фараби и Маркова с высокими потолками, панорамными окнами и вдохновляющими видами на город и горы',
            'ok-modal'    => 'Спасибо, ваша заявка отправлена!',
            'err-modal'   => 'Ошибка при отправке формы - обратитесь в Call Center',
        ],
        'menu'           => [
            'lang.kz'      => 'каз',
            'lang.ru'      => 'рус',
            'about'        => 'О проекте',
            'location'     => 'Окружение',
            'architecture' => 'Архитектура',
            'safety'       => 'Тонкая забота',
            'lobby'        => 'Лобби',
            'tech'         => 'Сервис',
            'courtyard'    => 'Двор',
            'fc'           => 'Vesper Family Club',
            'boulevard'    => 'Прогулочный бульвар',
            'avenue'       => 'Люксовое ритейл-пространство',
            'residences'   => 'Резиденции',
            'plans'        => 'Выбрать резиденцию',
            'progress'     => 'Ход строительства',
            'contacts'     => 'Контакты',
            'vision'       => 'Взгляд архитектора',
        ],
        'a_p'            => [
            'address'     => " Проспект Аль-Фараби и улица Маркова —\nлучшее, что может предложить город",
            'address.mob' => "Проспект Аль-Фараби и улица\nМаркова — лучшее, что может\nпредложить город",
            'subtitle'    => "Премиальные резиденции в Алматы,\nпо пр. Аль-Фараби и ул. Маркова,\nнапротив Almaty Theatre",
            'style'       => 'Стиль',
            'status'      => 'Статус',
            'char'        => 'Характер',
        ],
        'about'          => [
            'h1'           => 'A PRIVILEGED LIFE',
            'h3'           => 'ЖИЗНЬ С ОСОБЫМИ ПРИВИЛЕГИЯМИ',
            'caption'      => 'О проекте',
            'h2'           => 'Жизнь с особыми привилегиями',
            'cut'          => 'VESPER — это стиль жизни, где статус ощущается в тишине, а роскошь выражается в нюансах. Он создан не просто для жизни, а для наслаждения ею. VESPER находится в локации высокого уровня — в центре светской жизни города.',
            'cut.hidden'   => '',
            'vision'       => 'Оставить заявку',
            'presentation' => 'Презентация',
        ],
        'location'       => [
            'caption'    => 'the residences at vesper',
            'h1'         => 'РАЙОН КАК СТИЛЬ',
            'h2'         => 'Район как стиль',
            'cut'        => 'VESPER расположен по пр. Аль-Фараби и ул. Маркова — в Unique location, которую невозможно повторить, момент, который нельзя упустить. Внутренний импульс, особая энергия и территория безграничных привилегий. Заметное и осязаемое превосходство.',
            'cut.hidden' => '',
            'map-at'     => 'Almaty Theatre',
            'map-mu'     => 'Almaty Museum of Arts',
            'map-gc'     => "Генеральное консульство США\n(перспективное строительство)",
            'map-fc'     => 'Финансовый кластер',
            'map-em'     => 'Esentai Mall',
        ],
        'form'           => [
            'h1'             => 'получите персональное предложение',
            'h2'             => 'Оставьте заявку для индивидуальной консультации',
            'agreement.a'    => 'Нажимая на кнопку «заказать звонок» вы принимаете',
            'agreement.link' => 'условия',
            'agreement.b'    => 'обработки персональных данных',
            'name'           => 'имя',
            'button'         => 'заказать звонок',
        ],
        'architecture'   => [
            'image.a'    => 'TIMELESS ARCHITECTURE',
            'image.b'    => 'архитектура вне времени',
            'caption'    => 'Архитектура вне времени',
            'h2'         => 'О проекте',
            'cut'        => 'Архитектура VESPER воплощает эстетику высокого статуса через авторский подход, благородные материалы и внимание к каждой детали. Фасады из мраморного агломерата — монументальность, возведённая в абсолют. Балконы и эркеры увеличивают объём, открывая пространство для света и тишины. Панорамные окна — прозрачная граница между камерностью и мегаполисом. Крыша, как финальная архитектурная реплика, превращает силуэт VESPER в знаковую icon-доминанту.',
            'cut.hidden' => '',
        ],
        'safety'         => [
            'image.a' => 'SUBTLE CARE',
            'image.b' => 'ТОНКАЯ ЗАБОТА',
            'text'    => "Забота о вас заложена в философию проекта.\nВсе отточено настолько безукоризненно, что предвосхищает все Ваши ожидания.",
            'calm'    => 'KEEP CALM',
            'parking' => 'PARKING',
            'lifts'   => 'LIFTS',
            '01'      => 'система видеонаблюдения нового поколения',
            '02'      => 'приватное open air-пространство без доступа автотранспорта',
            '03'      => 'ID-access в комплекс, паркинг, лобби',
            '04'      => 'система доступа car ID',
            '05'      => 'total video control',
            '06'      => 'зарядные станции для электромобилей',
            '07'      => 'скоростные бесшумные лифты с ID-доступом на Ваш этаж',
        ],
        'lobby'          => [
            'caption'    => 'Лобби',
            'h1'         => 'ЛОББИ',
            'h2'         => 'Лобби',
            'cut'        => 'Лобби VESPER — это выразительное и амбициозное пространство с безупречным авторским дизайном, премиальными материалами и атмосферой приватного клуба. Concierge point с сервисом уровня лучших отелей создаёт для вас привычную заботу, а лаундж-пространства идеальны для неспешных small talk и деловых встреч. Авторский стиль здесь — не форма, а отражение внутреннего мира. Это система ценностей, воплощённая в линии, фактуре и свете. То, что ощущается, а не декларируется.',
            'cut.hidden' => '',
            'list.1'     => 'Мрамор',
            'list.2'     => 'Натуральное дерево',
            'list.3'     => 'Латунь',
            'list.4'     => 'Две входные группы: главная и во внутренний двор',
        ],
        'tech'           => [
            'caption' => 'the residences at vesper',
            'h1'      => 'Service',
            'h2'      => 'Сервис',
            'list.1'  => 'concierge-service 24/7: исключительный подход в решении любых пожеланий',
            'list.2'  => 'guest parking concierge',
            'list.3'  => 'комната отдыха в паркинге для водителей и личной охраны резидентов',
            'list.4'  => 'келлеры',
        ],
        'courtyard'      => [
            'caption'    => 'Мир, созданный для волшебства',
            'h1'         => "Private\nCourtyard",
            'h2'         => 'ПРИВАТНЫЙ ДВОР',
            'cut'        => 'Для самых дорогих жителей VESPER мы выбрали лучшее из возможного. IMAGINARIUM — для маленьких резидентов, где игра, обучение и фантазия объединяются в атмосферу творчества и радости. Это безопасная и живописная территория, рядом с которой раскинулся тенистый сад.',
            'cut.hidden' => '',
        ],
        'boulevard'      => [
            'caption' => 'Прогулочный бульвар',
            'h1'      => "ПРОГУЛОЧНЫЙ\nБУЛЬВАР",
            'h2'      => 'Прогулочный бульвар',
            'text'    => "Прогулочный бульвар проходит вдоль VESPER, продолжая его философию — тихо, изящно, в собственном ритме. Это место создано для ужинов с друзьями, деловых встреч, моментов, когда важна атмосфера. Это продолжение Вашего личного пространства, но за пределами резиденций.",
        ],
        'avenue'         => [
            'caption' => 'Люксовое ритейл-пространство',
            'h1'      => "luxury\nhigh\navenue",
            'h2'      => 'Люксовое ритейл-пространство',
            'text'    => 'Luxury High Avenue в VESPER — это приватный формат ретейла, в котором продумано всё: атмосфера, локации, ритм движения. Здесь нет случайных пространств — каждое создаёт нужное настроение.',
        ],
        'family_club'    => [
            'caption' => 'Vesper Family Club',
            'h1'      => "VESPER\nFAMILY CLUB",
            'text'    => 'Мы помогаем резидентам инвестировать время в себя и своих детей через досуг, который становится бенчмарком среди существующих стандартов.',
        ],
        'residences'     => [
            'caption'    => 'status multiplied by pleasure',
            'h1'         => 'THE RESIDENCES AT VESPER',
            'cut'        => 'Резиденции VESPER — это место вашей силы, где желания, амбиции и статус находят отражение в каждой детали.',
            'cut.hidden' => "Панорамные окна открывают непревзойдённые виды: на юге — горные вершины, на западе — энергия мегаполиса.\nЭто роскошь тишины, света и личного горизонта — то, что невозможно повторить.",
            'list.1'     => 'резиденции до 145 м² с видами на город и горы',
            'list.2'     => 'высота потолков от 3,15 до 3,3 метра',
            'list.3'     => 'панорамные окна в пол 280 х 275 см',
            'list.4'     => 'парящие эркеры на фасадах и открытые балконы',
            'list.5'     => 'оптимальный климат в резиденциях поддерживают внутрипольные конвекторы тепла',
        ],
        'slogan'         => [
            'h1'      => 'Well-being begins with the right space',
            'h2'      => 'Благополучие начинается с правильного пространства',
            'caption' => 'Status Multiplied By Pleasure',
        ],
        'plans'          => [
            'h1'              => 'Residences',
            'filters.rooms'   => 'КОЛИЧЕСТВО КОМНАТ',
            'filters.floor'   => 'ЭТАЖ',
            'filters.square'  => 'ПЛОЩАДЬ м²',
            'filters.price.m' => 'ЦЕНА тг. за м²',
            'filters.apply'   => 'ПРИМЕНИТЬ',
            'filters.from'    => 'от',
            'filters.to'      => 'до',
            'filters.after'   => '',
            'more'            => 'Ещё варианты',

        ],
        'progress'       => [
            'h1'         => 'Ход строительства',
            'areas'      => 'ПЯТНА',
            'areas.nums' => '12, 14, 16, 18 - 20',
            'readiness'  => 'ГОТОВНОСТЬ',
            'percentage' => '40',
            'more'       => 'ПОДРОБНЕЕ',
        ],
        'progress_modal' => [
            'h1'     => 'Ход строительства',
            'finish' => 'Срок завершения строительства - февраль 2027 г.',
        ],
        'contacts'       => [
            'h1'          => 'ОФИС ПРОДАЖ',
            'h2'          => 'Офис продаж:',
            'address'     => 'пр. Аль-Фараби, дом 41/1, ЖК "METROPOLE"',
            'tel.caption' => 'тел:',
            'tel.raw'     => '+77272777777',
            'tel'         => '+7(727) 2 777-777',
        ],
        'copyright'      => [
            'text' => "Предоставленные фотографии и 3D-иллюстрации, описание проекта и применяемые материалы, планировочные решения резиденций, инфраструктура и благоустройство комплекса являются условным примером организации жилого пространства и могут быть изменены в ходе строительства и эксплуатации. Данные указаны на момент выхода буклета в печать (август 2025 г.).\n\nРазрешение на привлечение денег дольщиков KZ88VWE00002535 (п. 12,16,19,20) от 13.08.2025 г., KZ07VWE00002538 (п. 14,18) от 19.08.2025 г.\nЗастройщик: ТОО «BAZIS-A Corp.»\nУполномоченная компания: ТОО «Sapphire Strоy»",
        ],
    ];

    const NL2BR = [
        'a_p.address',
        'a_p.address.mob',
        'a_p.subtitle',
        'architecture.cut.hidden',
        'safety.text',
        'courtyard.h1',
        'boulevard.h1',
        'avenue.h1',
        'avenue.text',
        'copyright.text',
    ];

    public function run(): void
    {
        foreach (self::DATA as $module => $data) {
            foreach ($data as $key => $value_ru) {
                $fullKey = implode('.', [$module, $key]);
                TemplateString::setup(
                    $module,
                    $key,
                    $value_ru,
                    'ru',
                    hint: in_array($fullKey, self::NL2BR)
                        ? 'переносы сохраняются'
                        : null
                );
            }
        }
    }
}
