{{--<ul class="points">--}}
{{--  <li id="services">--}}
{{--    <div class="_pic">--}}
{{--      <img src="{{ Vite::asset('resources/blocks/points/assets/pk.jpg') }}" alt="">--}}
{{--      <strong class="op-text">Technology & Services--}}
{{--        <sub>Технологии с сервисы</sub>--}}
{{--      </strong>--}}
{{--    </div>--}}
{{--    <div class="_text vertical-flow">--}}
{{--      <ul>--}}
{{--        <li>concierge-service 24/7: исключительный подход в решении любых пожеланий</li>--}}
{{--        <li>guest parking concierge</li>--}}
{{--        <li>комната отдыха в паркинге для водителей и личной охраны резидентов</li>--}}
{{--        <li>келлеры</li>--}}
{{--        <li>зарядные станции для электромобилей</li>--}}
{{--        <li>drop-o auto spa</li>--}}
{{--      </ul>--}}
{{--    </div>--}}
{{--  </li>--}}
{{--  <li id="lobby">--}}
{{--    <div class="_pic">--}}
{{--      <img src="{{ Vite::asset('resources/blocks/points/assets/3.jpg') }}" alt="">--}}
{{--      <strong class="op-text">THE ART OF FIRST IMPRESSION--}}
{{--        <sub>ИСКУССТВО ПЕРВОГО ВПЕЧАТЛЕНИЯ</sub>--}}
{{--      </strong>--}}
{{--    </div>--}}
{{--    <div class="_text vertical-flow">--}}
{{--      <p>--}}
{{--        Лобби VESPER — амбициозное пространство с безупречным авторским дизайном и премиальными материалами.--}}
{{--      </p>--}}
{{--      <p>--}}
{{--        Мрамор благородных оттенков, обработанные вручную декоративные элементы и произведения искусства из частной--}}
{{--        коллекции — собраны эксклюзивно для VESPER.--}}
{{--      </p>--}}
{{--      <p>--}}
{{--        Concierge point с сервисом уровня лучших отелей создаёт для вас привычную заботу, а лаундж-пространства идеальны--}}
{{--        для неспешных <i>small talk</i> и деловых встреч.--}}
{{--      </p>--}}
{{--    </div>--}}
{{--  </li>--}}
{{--  <li id="imaginarium">--}}
{{--    <div class="_pic">--}}
{{--      <img src="{{ Vite::asset('resources/blocks/points/assets/4.jpg') }}" alt="">--}}
{{--      <strong class="op-text">--}}
{{--        Private <br> Courtyard--}}
{{--        <sub>ПРИВАТНЫЙ ДВОР</sub>--}}
{{--      </strong>--}}
{{--    </div>--}}
{{--    <div class="_text vertical-flow">--}}
{{--      <p>--}}
{{--        Волшебное пространство Imaginarium - для маленьких резидентов, где игра, обучение и фантазия объединяются в--}}
{{--        атмосферу творчества и радости.--}}
{{--      </p>--}}
{{--      <p>--}}
{{--        Это безопасная и живописная территория, рядом с которой раскинут тенистый сад, чьи формы плавные словно их--}}
{{--        лепил ветер.--}}
{{--      </p>--}}
{{--      <p>--}}
{{--        Приватно. Безопасно. Все для детей – самых дорогих жителей VESPER, для которых мы выбрали лучшее из--}}
{{--        возможного.--}}
{{--      </p>--}}
{{--    </div>--}}
{{--  </li>--}}
{{--  <li id="boulevard">--}}
{{--    <div class="_pic">--}}
{{--      <img src="{{ Vite::asset('resources/blocks/points/assets/5.jpg') }}" alt="">--}}
{{--      <strong class="op-text">WELLNESS <br> Boulevard--}}
{{--        <sub>ПРОГУЛОЧНЫЙ БУЛЬВАР</sub>--}}
{{--      </strong>--}}
{{--    </div>--}}
{{--    <div class="_text vertical-flow">--}}
{{--      <p>--}}
{{--        Прогулочный бульвар проходит вдоль VESPER, продолжая его философию — тихо, изящно, в собственном ритме. Это--}}
{{--        место создано для ужинов с друзьями, деловых встреч, моментов, когда важна атмосфера. Это продолжение вашего--}}
{{--        личного пространства, но за пределами резиденций. И только для своих--}}
{{--      </p>--}}
{{--    </div>--}}
{{--  </li>--}}
{{--  <li id="retail">--}}
{{--    <div class="_pic">--}}
{{--      <img src="{{ Vite::asset('resources/blocks/points/assets/5.1.jpg') }}" alt="">--}}
{{--      <div class="op-text" data-end="90%">--}}
{{--        <strong>--}}
{{--          luxury <br>--}}
{{--          high <br>--}}
{{--          avenue--}}

{{--          <sub>люксовое ретейл-пространство</sub>--}}
{{--        </strong>--}}
{{--      </div>--}}
{{--    </div>--}}
{{--    <div class="_text vertical-flow">--}}
{{--      <p>--}}
{{--        Luxury High Avenue в VESPER - это приватный формат ретейла, в котором продумано всё: атмосфера, локации, ритм--}}
{{--        движения. Здесь нет случайных пространств – каждое создает нужное настроение. Это Ваша личная гастрономическая--}}
{{--        сцена.--}}
{{--      </p>--}}
{{--    </div>--}}
{{--  </li>--}}
{{--  <li id="residences">--}}
{{--    <div class="_pic -res">--}}
{{--      <img src="{{ Vite::asset('resources/blocks/points/assets/res.jpg') }}" alt="">--}}
{{--      <ul id="res-animation">--}}
{{--        <li class="-reveal">--}}
{{--          <div class="_text">--}}
{{--            резиденции--}}
{{--            <strong>до 145 м²</strong>--}}
{{--            с видами на динамику города и тишину гор--}}
{{--          </div>--}}
{{--        </li>--}}
{{--        <li>--}}
{{--          <span></span>--}}
{{--          <div class="_text">--}}
{{--            <strong>315 см</strong>--}}
{{--            высота потолков--}}
{{--          </div>--}}
{{--        </li>--}}
{{--        <li>--}}
{{--          <div class="_text">--}}
{{--            панорамные окна в пол--}}
{{--            <strong>280 х 255 см</strong>--}}
{{--            Двухкамерный стеклопакет с тройным остеклением с функцией повышенной звуко- и шумоизоляцией--}}
{{--            мультифункциональное внешнее остекление--}}
{{--          </div>--}}
{{--        </li>--}}
{{--      </ul>--}}
{{--    </div>--}}
{{--    <div class="_text vertical-flow">--}}
{{--      <h2>РЕЗИДЕНЦИИ</h2>--}}
{{--      <p>--}}
{{--        Резиденции VESPER — это место вашей силы, где желания, амбиции и статус находят отражение в каждой детали.--}}
{{--      </p>--}}
{{--      <p>--}}
{{--        Панорамные окна открывают непревзойдённые виды: на юге — горные вершины, на западе — энергия мегаполиса.--}}
{{--      </p>--}}
{{--      <p>--}}
{{--        Это роскошь тишины, света и личного горизонта — то, что невозможно повторить.--}}
{{--      </p>--}}
{{--    </div>--}}
{{--  </li>--}}
{{--</ul>--}}
